Autodesk.Revit.DB.AngularDimensionGeometryOptions.Create(Autodesk.Revit.DB.View,Autodesk.Revit.DB.DimensionType,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.Line)
Creates an instance of Autodesk.Revit.DB.AngularDimensionGeometryOptions with the specified parameters.
view:
The view whose properties will be used to compute the dimension geometry.
dimensionType:
The Autodesk.Revit.DB.DimensionType of the dimension.
arc:
The extension arc of the dimension.
firstLine:
The first reference line to which the dimension is to be bound.
secondLine:
The second reference line to which the dimension is to be bound. The line must not be parallel with the first reference line.
Returns:
Returns an instance of Autodesk.Revit.DB.AngularDimensionGeometryOptions with the specified parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The provided reference lines are parallel.

Autodesk.Revit.DB.AngularDimensionGeometryOptions
A class that encapsulates the options needed to create the Angular Dimension geometry.